export const navItemsName = [
  [
    {
      id: "1",
      text: "Mодуль 1 - Занятие 1 HTML часть 1",
      key: [
        {
          num: 1,
          href: "1-1",
          name: "Веб-технологии",
        },
        {
          num: 2,
          href: "1-2",
          name: "Теги и атрибуты",
        },
        {
          num: 3,
          href: "1-3",
          name: "Скелет HTML-документа",
        },
        {
          num: 4,
          href: "1-4",
          name: "Семантика",
        },
        {
          num: 5,
          href: "1-5",
          name: "Разметка текста",
        },
        {
          num: 6,
          href: "1-6",
          name: "Изображения",
        },
        {
          num: 7,
          href: "1-7",
          name: "Структурная разметка",
        },
        {
          num: 8,
          href: "1-8",
          name: "Валидация",
        },
        {
          num: 9,
          href: "1-9",
          name: "Инструменты разработчика",
        },
        {
          num: 10,
          href: "1-10",
          name: "Оформление кода",
        },
      ],
    },
    {
      id: "2",
      text: "Mодуль 1 - Занятие 1 HTML часть 2",
      key: [
        {
          num: 1,
          href: "2-1",
          name: "Таблицы",
        },
        {
          num: 2,
          href: "2-2",
          name: "Разметка текста",
        },
        {
          num: 3,
          href: "2-3",
          name: "Символьные подстановки",
        },
        {
          num: 4,
          href: "2-4",
          name: "Видео т аудио",
        },
      ],
    },
    {
      id: "3",
      text: "Mодуль 2 - Занятие 3 Селекторы и цвет",
      key: [
        {
          num: 1,
          href: "3-1",
          name: "Введение в CSS",
        },
        {
          num: 2,
          href: "3-2",
          name: "Селекторы",
        },
        {
          num: 3,
          href: "3-3",
          name: "Псевдоклассы состояния",
        },
        {
          num: 4,
          href: "3-4",
          name: "Работа с цветом",
        },
        {
          num: 5,
          href: "3-5",
          name: "Каскад стилей",
        },
        {
          num: 6,
          href: "3-6",
          name: "CSS-переменные",
        },
      ],
    },
    {
      id: "4",
      text: "Mодуль 2 - Занятие 4 Текст и шрифт",
      key: [
        {
          num: 1,
          href: "4-1",
          name: "Оформление текста",
        },
        {
          num: 2,
          href: "4-2",
          name: "Свойства шрифта",
        },
        {
          num: 3,
          href: "4-3",
          name: "Псевдоэлементы текста",
        },
        {
          num: 4,
          href: "4-4",
          name: "Нестандартные шрифты",
        },
      ],
    },
    {
      id: "5",
      text: "Mодуль 3 - Занятие 5 Блочная модель",
      key: [
        {
          num: 1,
          href: "5-1",
          name: "Блочная модель",
        },
        {
          num: 2,
          href: "5-2",
          name: "Геометрия элемента",
        },
        {
          num: 3,
          href: "5-3",
          name: "Типы элементов",
        },
        {
          num: 4,
          href: "5-4",
          name: "Структурные псевдоклассы",
        },
      ],
    },
    {
      id: "6",
      text: "Mодуль 3 - Занятие 6 Flexbox",
      key: [
        {
          num: 1,
          href: "6-1",
          name: "Основные концепции",
        },
        {
          num: 2,
          href: "6-2",
          name: "Свойства контейнера",
        },
        {
          num: 3,
          href: "6-3",
          name: "Свойства элемента",
        },
      ],
    },
    {
      id: "7",
      text: "Mодуль 4 - Занятие 7 Декоративные эффекты и элементы",
      key: [
        {
          num: 1,
          href: "7-1",
          name: "Типы изображений",
        },
        {
          num: 2,
          href: "7-2",
          name: "Фон элемента",
        },
        {
          num: 3,
          href: "7-3",
          name: "Свойства object-fit и object-position",
        },
        {
          num: 4,
          href: "7-4",
          name: "Псевдоэлементы",
        },
        {
          num: 5,
          href: "7-5",
          name: "Градиент",
        },
        {
          num: 6,
          href: "7-6",
          name: "Тень элемента",
        },
      ],
    },
    {
      id: "8",
      text: "Mодуль 4 - Занятие 8 Векторная графика",
      key: [
        {
          num: 1,
          href: "8-1",
          name: "Векторная графика",
        },
        {
          num: 2,
          href: "8-2",
          name: "SVG-элементы",
        },
        {
          num: 3,
          href: "8-3",
          name: "SVG-документы",
        },
        {
          num: 4,
          href: "8-4",
          name: "Использование",
        },
        {
          num: 5,
          href: "8-5",
          name: "Оформление фигур",
        },
      ],
    },
    {
      id: "9",
      text: "Модуль 5 - Занятие 9 - Позиционированные элементы",
      key: [
        {
          num: 1,
          href: "9-1",
          name: "Позиционированные элементы",
        },
        {
          num: 2,
          href: "9-2",
          name: "Свойство z-index",
        },
        {
          num: 3,
          href: "9-3",
          name: "Свойство overflow",
        },
      ],
    },
    {
      id: "10",
      text: "Mодуль 5 - Занятие 10 Анимация",
      key: [
        {
          num: 1,
          href: "10-1",
          name: "CSS-переходы",
        },
        {
          num: 2,
          href: "10-2",
          name: "Анимируемые свойства",
        },
        {
          num: 3,
          href: "10-3",
          name: "CSS-анимация",
        },
        {
          num: 4,
          href: "10-4",
          name: "Перспектива",
        },
        {
          num: 5,
          href: "10-5",
          name: "2D-трансформации",
        },
      ],
    },
    {
      id: "11",
      text: "Модуль 6 - Занятие 11 - Элементы форм",
      key: [
        {
          num: 1,
          href: "11-1",
          name: "Формы",
        },
        {
          num: 2,
          href: "11-2",
          name: "Элемент <form>",
        },
        {
          num: 3,
          href: "11-3",
          name: "Элемент <label>",
        },
        {
          num: 4,
          href: "11-4",
          name: "Элемент <input>",
        },
        {
          num: 5,
          href: "11-5",
          name: "Элемент <textarea>",
        },
        {
          num: 6,
          href: "11-6",
          name: "Элемент <select>",
        },
        {
          num: 7,
          href: "11-7",
          name: "Элемент <datalist>",
        },
        {
          num: 8,
          href: "11-8",
          name: "Групировка полей",
        },
      ],
    },
    {
      id: "12",
      text: "Модуль 6 - Занятие 12 - Валидация форм",
      key: [
        {
          num: 1,
          href: "12-1",
          name: "Валидация",
        },
        {
          num: 2,
          href: "12-2",
          name: "Атрибуты валидации",
        },
        {
          num: 3,
          href: "12-3",
          name: "Псевдоклассы состояния",
        },
      ],
    },
    {
      id: "13",
      text: "Модуль 7 - Занятие 13 - Методология BEM",
      key: [
        {
          num: 1,
          href: "13-1",
          name: "CSS-методологии",
        },
        {
          num: 2,
          href: "13-2",
          name: "Методология BEM",
        },
        {
          num: 3,
          href: "13-3",
          name: "Блок",
        },
        {
          num: 4,
          href: "13-4",
          name: "Элемент",
        },
        {
          num: 5,
          href: "13-5",
          name: "Модификатор",
        },
        {
          num: 6,
          href: "13-6",
          name: "Микс",
        },
        {
          num: 7,
          href: "13-7",
          name: "Селекторы",
        },
        {
          num: 8,
          href: "13-8",
          name: "Секция товаров",
        },
      ],
    },
    {
      id: "14",
      text: "Модуль 7 - Занятие 14 - Препроцессор SASS",
      key: [
        {
          num: 1,
          href: "14-1",
          name: "Препроцессоры",
        },
        {
          num: 2,
          href: "14-2",
          name: "Переменные",
        },
        {
          num: 3,
          href: "14-3",
          name: "Вложенные правила",
        },
        {
          num: 4,
          href: "14-4",
          name: "Арифметические операции",
        },
        {
          num: 5,
          href: "14-5",
          name: "Директива @import",
        },
        {
          num: 6,
          href: "14-6",
          name: "Директива @extend",
        },
        {
          num: 7,
          href: "14-7",
          name: "Директива @mixin",
        },
        {
          num: 8,
          href: "14-8",
          name: "Директива @each",
        },
        {
          num: 9,
          href: "14-9",
          name: "Карты (словари)",
        },
        {
          num: 10,
          href: "14-10",
          name: "Вендорные префиксы",
        },
      ],
    },
    {
      id: "15",
      text: "Модуль 8 - Занятие 15 - Адаптивная вёрстка",
      key: [
        {
          num: 1,
          href: "15-1",
          name: "Медиа-запросы",
        },
        {
          num: 2,
          href: "15-2",
          name: "Метатег viewport",
        },
        {
          num: 3,
          href: "15-3",
          name: "Инструменты разработчика",
        },
        {
          num: 4,
          href: "15-4",
          name: "Типы вёрстки",
        },
        {
          num: 5,
          href: "15-5",
          name: "Стратегия Mobile First",
        },
      ],
    },
    {
      id: "16",
      text: "Модуль 8 - Занятие 16 - Адаптивная графика",
      key: [
        {
          num: 1,
          href: "16-1",
          name: "Плотность пикселей",
        },
        {
          num: 2,
          href: "16-2",
          name: "Отзывчивые изображения",
        },
        {
          num: 3,
          href: "16-3",
          name: "Отзывчивые фоновые изображения",
        },
        {
          num: 4,
          href: "16-4",
          name: "Отзывчивый элемент <img>",
        },
        {
          num: 5,
          href: "16-5",
          name: "Элемент <picture>",
        },
      ],
    },
  ],
];
