import s from "../../StyleBox.module.scss";
export const JsUr1 = () => {
  return (
    <>
      <div className={s.boxInfo}>
        <h2>Знакомство с JavaScript</h2>
        <p>
          Когда мы говорим о программировании, первое, что приходит в голову это
          набор инструкций в файле. Исходный код (source code) - это текст
          компьютерной программы на любом языке программирования, набор
          удобочитаемых синтаксических конструкций, описывающих набор инструкций
          для компьютера.
        </p>
      </div>
    </>
  );
};
