import s from '../../StyleBox.module.scss'
export const HtmlM1L2Ur2 = () => {
  return (
    <>
      <div className={s.boxInfo}>
        <h2>Разметка текста</h2>
        <p>
          Тег &lt;dl&gt; (description list) это контейнер для списка пар
          терминов и их описаний, то есть словарь. Для разметки терминов есть
          тег &lt;dt&gt;, а для описаний &lt;dd&gt;. Используется для разметки
          списка определений, например при создании глоссария, телефонного
          справочника и т. п.
        </p>
      </div>
    </>
  );
};
